epsilonrt/duino-boards/duino-boards/boards.txt
################################################################################
## This file is created by epsilonrt for use with duino boards
## https://github.com/epsilonrt/duino-boards
##
## This is the file where fuse settings, BOD options and compiler flags are located.
################################################################################

# Menu options
menu.BOD=BOD
menu.LTO=Compiler LTO

################################################################################

xplbee.name=xPLBee
xplbee.upload.tool=avrdude
xplbee.upload.protocol=arduino
xplbee.upload.maximum_size=130048
xplbee.upload.maximum_data_size=16384
xplbee.upload.speed=115200

xplbee.bootloader.tool=avrdude
xplbee.bootloader.unlock_bits=0xff
xplbee.bootloader.lock_bits=0x0f
xplbee.bootloader.low_fuses=0xf7
xplbee.bootloader.high_fuses=0x1e
xplbee.bootloader.file=optiboot-xplbee.hex

xplbee.build.mcu=atmega1284p
xplbee.build.board=xplbee
xplbee.build.core=MightyCore
xplbee.build.f_cpu=16000000L
xplbee.build.variant=standard

# Brown out detection
xplbee.menu.BOD.2v7=2.7v
xplbee.menu.BOD.2v7.bootloader.extended_fuses=0xfd
xplbee.menu.BOD.4v3=4.3v
xplbee.menu.BOD.4v3.bootloader.extended_fuses=0xfc
xplbee.menu.BOD.1v8=1.8v
xplbee.menu.BOD.1v8.bootloader.extended_fuses=0xfe
xplbee.menu.BOD.disabled=Disabled
xplbee.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
xplbee.menu.LTO.Os=Disabled (default)
xplbee.menu.LTO.Os.compiler.c.extra_flags=
xplbee.menu.LTO.Os.compiler.c.elf.extra_flags=
xplbee.menu.LTO.Os.compiler.cpp.extra_flags=
xplbee.menu.LTO.Os.ltoarcmd=avr-ar

xplbee.menu.LTO.Os_flto=Enabled
xplbee.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
xplbee.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
xplbee.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
xplbee.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

##############################################################

hmi4dinbox.name=Him4DinBox HMI
hmi4dinbox.vid.0=0x2341
hmi4dinbox.pid.0=0x0036

hmi4dinbox.upload.tool=avrdude
hmi4dinbox.upload.protocol=avr109
hmi4dinbox.upload.maximum_size=28672
hmi4dinbox.upload.maximum_data_size=2560
hmi4dinbox.upload.speed=57600
hmi4dinbox.upload.disable_flushing=true
hmi4dinbox.upload.use_1200bps_touch=true
hmi4dinbox.upload.wait_for_upload_port=true

hmi4dinbox.bootloader.tool=avrdude
hmi4dinbox.bootloader.low_fuses=0xff
hmi4dinbox.bootloader.high_fuses=0x98
hmi4dinbox.bootloader.extended_fuses=0xcb
hmi4dinbox.bootloader.file=caterina-hmi4dinbox.hex
hmi4dinbox.bootloader.unlock_bits=0xff
hmi4dinbox.bootloader.lock_bits=0xef

hmi4dinbox.build.mcu=atmega32u4
hmi4dinbox.build.f_cpu=16000000L
hmi4dinbox.build.vid=0x2341
hmi4dinbox.build.pid=0x8036
hmi4dinbox.build.usb_product="Arduino Leonardo"
hmi4dinbox.build.board=AVR_LEONARDO
hmi4dinbox.build.core=arduino
hmi4dinbox.build.variant=hmi4dinbox
hmi4dinbox.build.extra_flags={build.usb_flags}

# Brown out detection
hmi4dinbox.menu.BOD.2v6=2.6v (default)
hmi4dinbox.menu.BOD.2v6.bootloader.extended_fuses=0xcb
hmi4dinbox.menu.BOD.2v0=2.0v
hmi4dinbox.menu.BOD.2v0.bootloader.extended_fuses=0xce
hmi4dinbox.menu.BOD.2v2=2.2v
hmi4dinbox.menu.BOD.2v2.bootloader.extended_fuses=0xcd
hmi4dinbox.menu.BOD.2v4=2.4v
hmi4dinbox.menu.BOD.2v4.bootloader.extended_fuses=0xcc
hmi4dinbox.menu.BOD.3v4=3.4v
hmi4dinbox.menu.BOD.3v4.bootloader.extended_fuses=0xca
hmi4dinbox.menu.BOD.3v5=3.5v
hmi4dinbox.menu.BOD.3v5.bootloader.extended_fuses=0xc9
hmi4dinbox.menu.BOD.4v3=4.3v
hmi4dinbox.menu.BOD.4v3.bootloader.extended_fuses=0xc8
hmi4dinbox.menu.BOD.disabled=Disabled
hmi4dinbox.menu.BOD.disabled.bootloader.extended_fuses=0xcf

# Compiler link time optimization
hmi4dinbox.menu.LTO.Os=Disabled (default)
hmi4dinbox.menu.LTO.Os.compiler.c.extra_flags=
hmi4dinbox.menu.LTO.Os.compiler.c.elf.extra_flags=
hmi4dinbox.menu.LTO.Os.compiler.cpp.extra_flags=
hmi4dinbox.menu.LTO.Os.ltoarcmd=avr-ar

hmi4dinbox.menu.LTO.Os_flto=Enabled
hmi4dinbox.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
hmi4dinbox.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
hmi4dinbox.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
hmi4dinbox.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

##############################################################

touerismb.name=Toueris MODBUS Slave
touerismb.vid.0=0x2341
touerismb.pid.0=0x0036

touerismb.upload.tool=avrdude
touerismb.upload.protocol=avr109
touerismb.upload.maximum_size=28672
touerismb.upload.maximum_data_size=2560
touerismb.upload.speed=57600
touerismb.upload.disable_flushing=true
touerismb.upload.use_1200bps_touch=true
touerismb.upload.wait_for_upload_port=true

touerismb.bootloader.tool=avrdude
touerismb.bootloader.low_fuses=0xff
touerismb.bootloader.high_fuses=0x98
touerismb.bootloader.extended_fuses=0xcb
touerismb.bootloader.file=caterina-toueris-modbus.hex
touerismb.bootloader.unlock_bits=0xff
touerismb.bootloader.lock_bits=0xef

touerismb.build.mcu=atmega32u4
touerismb.build.f_cpu=16000000L
touerismb.build.vid=0x2341
touerismb.build.pid=0x8036
touerismb.build.usb_product="Arduino Leonardo"
touerismb.build.board=AVR_LEONARDO
touerismb.build.core=arduino
touerismb.build.variant=toueris-modbus
touerismb.build.extra_flags={build.usb_flags}

# Brown out detection
touerismb.menu.BOD.2v6=2.6v (default)
touerismb.menu.BOD.2v6.bootloader.extended_fuses=0xcb
touerismb.menu.BOD.2v0=2.0v
touerismb.menu.BOD.2v0.bootloader.extended_fuses=0xce
touerismb.menu.BOD.2v2=2.2v
touerismb.menu.BOD.2v2.bootloader.extended_fuses=0xcd
touerismb.menu.BOD.2v4=2.4v
touerismb.menu.BOD.2v4.bootloader.extended_fuses=0xcc
touerismb.menu.BOD.3v4=3.4v
touerismb.menu.BOD.3v4.bootloader.extended_fuses=0xca
touerismb.menu.BOD.3v5=3.5v
touerismb.menu.BOD.3v5.bootloader.extended_fuses=0xc9
touerismb.menu.BOD.4v3=4.3v
touerismb.menu.BOD.4v3.bootloader.extended_fuses=0xc8
touerismb.menu.BOD.disabled=Disabled
touerismb.menu.BOD.disabled.bootloader.extended_fuses=0xcf

# Compiler link time optimization
touerismb.menu.LTO.Os=Disabled (default)
touerismb.menu.LTO.Os.compiler.c.extra_flags=
touerismb.menu.LTO.Os.compiler.c.elf.extra_flags=
touerismb.menu.LTO.Os.compiler.cpp.extra_flags=
touerismb.menu.LTO.Os.ltoarcmd=avr-ar

touerismb.menu.LTO.Os_flto=Enabled
touerismb.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
touerismb.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
touerismb.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
touerismb.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar


##############################################################

pointcastmb.name=PointCast Supervisor MODBUS Slave
pointcastmb.vid.0=0x2341
pointcastmb.pid.0=0x0036

pointcastmb.upload.tool=avrdude
pointcastmb.upload.protocol=avr109
pointcastmb.upload.maximum_size=28672
pointcastmb.upload.maximum_data_size=2560
pointcastmb.upload.speed=57600
pointcastmb.upload.disable_flushing=true
pointcastmb.upload.use_1200bps_touch=true
pointcastmb.upload.wait_for_upload_port=true

pointcastmb.bootloader.tool=avrdude
pointcastmb.bootloader.low_fuses=0xff
pointcastmb.bootloader.high_fuses=0x98
pointcastmb.bootloader.extended_fuses=0xcb
pointcastmb.bootloader.file=caterina-pointcast-modbus.hex
pointcastmb.bootloader.unlock_bits=0xff
pointcastmb.bootloader.lock_bits=0xef

pointcastmb.build.mcu=atmega32u4
pointcastmb.build.f_cpu=16000000L
pointcastmb.build.vid=0x2341
pointcastmb.build.pid=0x8036
pointcastmb.build.usb_product="Arduino Leonardo"
pointcastmb.build.board=AVR_LEONARDO
pointcastmb.build.core=arduino
pointcastmb.build.variant=pointcast-modbus
pointcastmb.build.extra_flags={build.usb_flags}

# Brown out detection
pointcastmb.menu.BOD.2v6=2.6v (default)
pointcastmb.menu.BOD.2v6.bootloader.extended_fuses=0xcb
pointcastmb.menu.BOD.2v0=2.0v
pointcastmb.menu.BOD.2v0.bootloader.extended_fuses=0xce
pointcastmb.menu.BOD.2v2=2.2v
pointcastmb.menu.BOD.2v2.bootloader.extended_fuses=0xcd
pointcastmb.menu.BOD.2v4=2.4v
pointcastmb.menu.BOD.2v4.bootloader.extended_fuses=0xcc
pointcastmb.menu.BOD.3v4=3.4v
pointcastmb.menu.BOD.3v4.bootloader.extended_fuses=0xca
pointcastmb.menu.BOD.3v5=3.5v
pointcastmb.menu.BOD.3v5.bootloader.extended_fuses=0xc9
pointcastmb.menu.BOD.4v3=4.3v
pointcastmb.menu.BOD.4v3.bootloader.extended_fuses=0xc8
pointcastmb.menu.BOD.disabled=Disabled
pointcastmb.menu.BOD.disabled.bootloader.extended_fuses=0xcf

# Compiler link time optimization
pointcastmb.menu.LTO.Os=Disabled (default)
pointcastmb.menu.LTO.Os.compiler.c.extra_flags=
pointcastmb.menu.LTO.Os.compiler.c.elf.extra_flags=
pointcastmb.menu.LTO.Os.compiler.cpp.extra_flags=
pointcastmb.menu.LTO.Os.ltoarcmd=avr-ar

pointcastmb.menu.LTO.Os_flto=Enabled
pointcastmb.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
pointcastmb.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
pointcastmb.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
pointcastmb.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar
